МТСД/src/Documents/WA_ЧекЛист/WA_ЧекЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>WA_ЧекЛист</name>
  <comment>ТП.U08.02-5 Формирование чек-листа по приемке товаров в магазине</comment>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.WA_СтатусыЧекЛистов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектПроверки</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеСтрокиОбъектаПроверки</name>
    <type>
      <types>String</types>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтрокиОбъектаПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЧекЛиста</name>
    <type>
      <types>CatalogRef.WA_ШаблоныЧекЛиста</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмОбработкиПройденногоЧекЛистаВыполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Аннулирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РезультатыПроверки</name>
    <attributes>
      <name>ПунктЧекЛиста</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.WA_ПунктыЧекЛиста</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПрохождения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстВопроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пройден</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеПройден</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.WA_ПунктыЧекЛиста</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Файлы</name>
    <attributes>
      <name>ПунктЧекЛиста</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.WA_ПунктыЧекЛиста</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.WA_ЧекЛистПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФайлыМТСД</name>
    <attributes>
      <name>ПунктЧекЛиста</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.WA_ПунктыЧекЛиста</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.МТСД_ХранимыеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МТСД/src/Documents/WA_ЧекЛист/Forms/ФормаДокументаАвтономныйСервер/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого Строка из Объект.РезультатыПроверки Цикл
		Строка.ПройденТекст = "Пройден";
		Строка.НеПройденТекст = "Не пройден";
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатыПроверкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Элементы.ГруппаРезультатыПроверкиСтраницы.ТекущаяСтраница = Элементы.ГруппаРезультатыПроверкиОднаСтрока;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатыПроверкиПриАктивизацииЯчейки(Элемент)
	
	ТекущиеДанные = Элементы.РезультатыПроверки.ТекущиеДанные;
	Если Элемент.ТекущийЭлемент.Имя = "РезультатыПроверкиПройденТекст" Тогда
		ИзменитьОтметкуПройденНеПройден("Пройден");
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "РезультатыПроверкиНеПройденТекст" Тогда
		ИзменитьОтметкуПройденНеПройден("НеПройден");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактированиеСтрокиРезультатаПроверки(Команда = Неопределено)
	
	Элементы.ГруппаРезультатыПроверкиСтраницы.ТекущаяСтраница = Элементы.ГруппаРезультатыПроверкиТаблица;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатыПроверкиНеПройденТекстОднаСтрокаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИзменитьОтметкуПройденНеПройден("НеПройден");
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатыПроверкиПройденТекстОднаСтрокаНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ИзменитьОтметкуПройденНеПройден("Пройден");

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтметкуПройденНеПройден(ИмяПоляОтметки)
	
	ТекущиеДанные = Элементы.РезультатыПроверки.ТекущиеДанные;
	ТекущиеДанные[ИмяПоляОтметки] = НЕ ТекущиеДанные[ИмяПоляОтметки];
	
	ИмяВторогоПоля = ?(ИмяПоляОтметки = "Пройден", "НеПройден", "Пройден");
	ТекущиеДанные[ИмяВторогоПоля] = Ложь;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Элементы.ГруппаРезультатыПроверкиСтраницы.ТекущаяСтраница = Элементы.ГруппаРезультатыПроверкиОднаСтрока Тогда
		Отказ = Истина;
		ЗавершитьРедактированиеСтрокиРезультатаПроверки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Элементы.ГруппаРезультатыПроверкиСтраницы.ТекущаяСтраница = Элементы.ГруппаРезультатыПроверкиОднаСтрока Тогда
		Отказ = Истина;
		ЗавершитьРедактированиеСтрокиРезультатаПроверки();
	КонецЕсли;

КонецПроцедуры
